Autodesk.Revit.DB.Electrical.AnalyticalTransferSwitchData.Voltage
The voltage value of the electrical analytical transfer switch.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for voltage is not a number
-or-
When setting this property: The given value for voltage is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for voltage must be positive.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The voltage on the analytical node is not editable.
Since:
2023